GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_rcu.c
    RCU_CFG0 = (reg | usb_psc);
}

/*!
    \brief      configure the RTC clock source selection
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC40K: CK_IRC40K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_128: CK_HXTAL/128 selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;
    
    reg = RCU_BDCTL; 
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    RCU_BDCTL = (reg | rtc_clock_source);
}

/*!
    \brief      configure the SHRTIMER clock source selection
    \param[in]  shrtimer_clock_source: SHRTIMER clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SHRTIMERSRC_CKAPB2: APB2 clock selected as SHRTIMER source clock
      \arg        RCU_SHRTIMERSRC_CKSYS: system clock selected as SHRTIMER source clock 
    \param[out] none
    \retval     none
*/
void rcu_shrtimer_clock_config(uint32_t shrtimer_clock_source)
{
    uint32_t reg;
    
    reg = RCU_CFG1; 
    /* reset the I2S1SEL bit and set according to shrtimer_clock_source */
    reg &= ~RCU_CFG1_SHRTIMERSEL;
    RCU_CFG1 = (reg | shrtimer_clock_source);
}

/*!
    \brief      configure the USART5 clock source selection
    \param[in]  usart5_clock_source: USART5 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USART5SRC_CKAPB2: APB2 clock selected as USART5 source clock
      \arg        RCU_USART5SRC_CKSYS: system clock selected as USART5 source clock 
      \arg        RCU_USART5SRC_LXTAL: LXTAL clock selected as USART5 source clock
      \arg        RCU_USART5SRC_IRC8M: IRC8M clock selected as USART5 source clock
    \param[out] none
    \retval     none
*/
void rcu_usart5_clock_config(uint32_t usart5_clock_source)
{
    uint32_t reg;
    reg = RCU_CFG2; 
    /* reset the I2S1SEL bit and set according to usart5_clock_source */
    reg &= ~RCU_CFG2_USART5SEL;
    RCU_CFG2 = (reg | usart5_clock_source);
}

/*!
    \brief      configure the I2C2 clock source selection
    \param[in]  i2c2_clock_source: I2C2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2C2SRC_CKAPB1: APB1 clock selected as I2C2 source clock
      \arg        RCU_I2C2SRC_CKSYS: system clock selected as I2C2 source clock
      \arg        RCU_I2C2SRCSRC_CKIRC8M: CK_IRC8M clock selected as I2C2 source clock  
    \param[out] none
    \retval     none
*/
void rcu_i2c2_clock_config(uint32_t i2c2_clock_source)
{
    uint32_t reg;
    
    reg = RCU_CFG2; 
    /* reset the I2S1SEL bit and set according to i2c2_clock_source */
    reg &= ~RCU_CFG2_I2C2SEL;
    RCU_CFG2 = (reg | i2c2_clock_source);
}

/*!
    \brief      configure the CK48M clock source selection
    \param[in]  ck48m_clock_source: CK48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK48MSRC_CKPLL: CK_PLL selected as CK48M source clock
      \arg        RCU_CK48MSRC_IRC48M: CK_IRC48M selected as CK48M source clock
      \arg        RCU_CK48MSRC_CKPLLUSB: CKPLLUSB selected as CK48M source clock 
      \arg        RCU_CK48MSRC_CKPLL2: CKPLL2 selected as CK48M source clock
    \param[out] none
    \retval     none
*/
void rcu_ck48m_clock_config(uint32_t ck48m_clock_source)
{
    uint32_t reg;
    
    reg = RCU_ADDCTL;
    /* reset the CK48MSEL bit and set according to ck48m_clock_source */
    reg &= ~RCU_ADDCTL_CK48MSEL;
    RCU_ADDCTL = (reg | ck48m_clock_source);
}

/*!
    \brief      configure the I2S1 clock source selection
    \param[in]  i2s_clock_source: I2S1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S1SRC_CKSYS: system clock selected as I2S1 source clock
      \arg        RCU_I2S1SRC_CKPLL2_MUL2: CK_PLL2 * 2 selected as I2S1 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2s1_clock_config(uint32_t i2s_clock_source)
{
    uint32_t reg;
    
    reg = RCU_CFG1; 
    /* reset the I2S1SEL bit and set according to i2s_clock_source */
    reg &= ~RCU_CFG1_I2S1SEL;
    RCU_CFG1 = (reg | i2s_clock_source);
}

/*!
    \brief      configure the I2S2 clock source selection
    \param[in]  i2s_clock_source: I2S2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S2SRC_CKSYS: system clock selected as I2S2 source clock
      \arg        RCU_I2S2SRC_CKPLL2_MUL2: CK_PLL2 * 2 selected as I2S2 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2s2_clock_config(uint32_t i2s_clock_source)
{
    uint32_t reg;
    
    reg = RCU_CFG1; 
    /* reset the I2S2SEL bit and set according to i2s_clock_source */
    reg &= ~RCU_CFG1_I2S2SEL;
    RCU_CFG1 = (reg | i2s_clock_source);
}

/*!
    \brief      configure the USBHSSEL source clock selection
    \param[in]  usbhssel_clock_source: USBHSSEL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBHSSRC_48M: 48M clock selected as USBHS source clock
      \arg        RCU_CK48MSRC_60M: 60M clock selected as USBHS source clock
    \param[out] none
    \retval     none
*/
void rcu_usbhssel_config(uint32_t usbhssel_clock_source)
{
    uint32_t reg = 0U;

    reg = RCU_ADDCTL;

    /* USBHS clock source selection */
    reg &= ~RCU_ADDCTL_USBHSSEL;
    reg |= usbhssel_clock_source;

    RCU_ADDCTL = reg;
}

/*!
    \brief      configure the USBHSDV division factor
    \param[in]  usbhs_dv: USBHSDV division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBHSDV_DIV2: USBHSDV input source clock divided by 2
      \arg        RCU_USBHSDV_DIV4: USBHSDV input source clock divided by 4
      \arg        RCU_USBHSDV_DIV6: USBHSDV input source clock divided by 6
      \arg        RCU_USBHSDV_DIV8: USBHSDV input source clock divided by 8
      \arg        RCU_USBHSDV_DIV10: USBHSDV input source clock divided by 10
      \arg        RCU_USBHSDV_DIV12: USBHSDV input source clock divided by 12
      \arg        RCU_USBHSDV_DIV14: USBHSDV input source clock divided by 14
      \arg        RCU_USBHSDV_DIV16: USBHSDV input source clock divided by 16
    \param[out] none
    \retval     none
*/
void rcu_usbdv_config(uint32_t usbhs_dv)
{
    uint32_t reg = 0U;

    reg = RCU_ADDCTL;

    /* usbhs input clock source division factor */
    reg &= ~RCU_ADDCTL_USBHSDV;
    reg |= usbhs_dv;

    RCU_ADDCTL = reg;
}

/*!
    \brief      configure the LXTAL drive capability
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: lower driving capability
      \arg        RCU_LXTAL_MED_LOWDRI: medium low driving capability
      \arg        RCU_LXTAL_MED_HIGHDRI: medium high driving capability
      \arg        RCU_LXTAL_HIGHDRI: higher driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;
    
    reg = RCU_BDCTL;
    
    /* reset the LXTALDRI bits and set according to lxtal_dricap */
    reg &= ~RCU_BDCTL_LXTALDRI;
    RCU_BDCTL = (reg | lxtal_dricap);
}

/*!
    \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_IRC8M: internal 8M RC oscillators(IRC8M)
      \arg        RCU_IRC48M: internal 48M RC oscillators(IRC48M)
      \arg        RCU_IRC40K: internal 40K RC oscillator(IRC40K)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
      \arg        RCU_PLL1_CK: phase locked loop 1
      \arg        RCU_PLL2_CK: phase locked loop 2
      \arg        RCU_PLLUSB_CK: phase locked loop USB
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;
    
    switch(osci){
    /* wait HXTAL stable */
    case RCU_HXTAL:
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)){
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }

